app/controllers/pokemons_controller.rb

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "pokemons" SET "trainer_id" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["trainer_id", 5], ["updated_at", "2016-11-02 22:32:50.368294"], ["id", 2]]
---
  def capture
    @pokemon = Pokemon.find(params[:id])
    @pokemon.trainer = current_trainer
    @pokemon.save

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", nil]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 2]]
UPDATE "pokemons" SET "health" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["health", 90], ["updated_at", "2016-11-03 01:17:18.196797"], ["id", 2]]
---
  def damage
    @pokemon = Pokemon.find(params[:id])
    @pokemon.health -= 10
    if @pokemon.health <= 0
      @pokemon.destroy
    else
      @pokemon.save

INSERT INTO "pokemons" ("name", "trainer_id", "level", "health", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "GOOBERTINO"], ["trainer_id", 5], ["level", 1], ["health", 100], ["created_at", "2016-11-03 01:17:39.186601"], ["updated_at", "2016-11-03 01:17:39.186601"]]
---
  def create
    @pokemon = Pokemon.new(pokemon_params)
    @pokemon.trainer = current_trainer
    @pokemon.level = 1
    @pokemon.health = 100
      if @pokemon.save